2024-06-25-go-patterns.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="description" content="This a personal note for the [[https://www.youtube.com/watch?v=IdCbMO0Ey9I][Go lecture]].">
<link rel="alternate"
      type="application/rss+xml"
      href="https://chenyo-17.github.io/org-static-blog/rss.xml"
      title="RSS feed for https://chenyo-17.github.io/org-static-blog">
<title>Go patterns</title>
</head>
<body>
<div id="preamble" class="status"></div>
<div id="content">
<div class="post-date">25 Jun 2024</div><h1 class="post-title"><a href="https://chenyo-17.github.io/org-static-blog/2024-06-25-go-patterns.html">Go patterns</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org22d49b8">1. Concurrency vs Parallelism</a></li>
<li><a href="#orgdcb5074">2. Use goroutines for states</a>
<ul>
<li><a href="#orgb3aef5e">2.1. Matching a regex</a></li>
<li><a href="#org2f1ba4e">2.2. When the state variable cannot be avoided</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-org22d49b8" class="outline-2">
<h2 id="org22d49b8"><span class="section-number-2">1.</span> Concurrency vs Parallelism</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Concurrency: write a program to handle lot of things at once
<ul class="org-ul">
<li>not necessarily faster</li>
</ul></li>
<li>Parallelism: the program itself can do a lot of computations at once</li>
</ul>
</div>
</div>
<div id="outline-container-orgdcb5074" class="outline-2">
<h2 id="orgdcb5074"><span class="section-number-2">2.</span> Use goroutines for states</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb3aef5e" class="outline-3">
<h3 id="orgb3aef5e"><span class="section-number-3">2.1.</span> Matching a regex</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>return if a given string matches a regex: start with <code>"</code>, contains arbitrary escape sequence and ends with <code>*</code></li>
<li><p>
unclear logic: store states in the data
</p>
<div class="org-src-container">
<pre class="src src-go"><span class="linenr"> 1: </span><span style="color: #dcaeea;">state</span> := <span style="color: #da8548; font-weight: bold;">0</span>
<span class="linenr"> 2: </span><span style="color: #51afef;">for</span> {
<span class="linenr"> 3: </span>    <span style="color: #dcaeea;">c</span> := <span style="color: #c678dd;">read</span>()
<span class="linenr"> 4: </span>    <span style="color: #51afef;">switch</span> state {
<span class="linenr"> 5: </span>    <span style="color: #51afef;">case</span> <span style="color: #da8548; font-weight: bold;">0</span>:
<span class="linenr"> 6: </span>        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">first char must be "</span>
<span class="linenr"> 7: </span>        <span style="color: #51afef;">if</span> c != <span style="color: #98be65;">'"'</span> {
<span class="linenr"> 8: </span>            <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">false</span>
<span class="linenr"> 9: </span>        }
<span class="linenr">10: </span>        state = <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #5B6268;">// </span><span style="color: #5B6268;">match the next char</span>
<span class="linenr">11: </span>    <span style="color: #51afef;">case</span> <span style="color: #da8548; font-weight: bold;">1</span>:
<span class="linenr">12: </span>        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">ending with " matches</span>
<span class="linenr">13: </span>        <span style="color: #51afef;">if</span> c == <span style="color: #98be65;">'"'</span> {
<span class="linenr">14: </span>            <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">true</span>
<span class="linenr">15: </span>        }
<span class="linenr">16: </span>        <span style="color: #51afef;">if</span> c == <span style="color: #98be65;">'\\'</span> {
<span class="linenr">17: </span>            state = <span style="color: #da8548; font-weight: bold;">2</span>
<span class="linenr">18: </span>        } <span style="color: #51afef;">else</span> {
<span class="linenr">19: </span>            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">transition to state 1 to match next char</span>
<span class="linenr">20: </span>            state = <span style="color: #da8548; font-weight: bold;">1</span>
<span class="linenr">21: </span>        }
<span class="linenr">22: </span>    <span style="color: #51afef;">case</span> <span style="color: #da8548; font-weight: bold;">2</span>:
<span class="linenr">23: </span>        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">read the char, discard it and</span>
<span class="linenr">24: </span>        state = <span style="color: #da8548; font-weight: bold;">1</span>
<span class="linenr">25: </span>    }
<span class="linenr">26: </span>}
</pre>
</div></li>
<li><p>
clear logic: store states in the code
</p>
<div class="org-src-container">
<pre class="src src-go"><span class="linenr"> 1: </span><span style="color: #5B6268;">// </span><span style="color: #5B6268;">no variable to store state</span>
<span class="linenr"> 2: </span><span style="color: #51afef;">if</span> <span style="color: #c678dd;">read</span>() != <span style="color: #98be65;">'"'</span> {
<span class="linenr"> 3: </span>    <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">false</span>
<span class="linenr"> 4: </span>}
<span class="linenr"> 5: </span><span style="color: #51afef;">var</span> <span style="color: #dcaeea;">c</span> <span style="color: #ECBE7B;">rune</span> <span style="color: #5B6268;">// </span><span style="color: #5B6268;">c is a Unicode, alas to int32</span>
<span class="linenr"> 6: </span><span style="color: #51afef;">for</span> c != <span style="color: #98be65;">'"'</span> {
<span class="linenr"> 7: </span>    c = <span style="color: #c678dd;">read</span>()
<span class="linenr"> 8: </span>    <span style="color: #51afef;">if</span> c == <span style="color: #98be65;">'\\'</span> {
<span class="linenr"> 9: </span>        <span style="color: #c678dd;">read</span>()  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">skip the next char</span>
<span class="linenr">10: </span>    }
<span class="linenr">11: </span>}
<span class="linenr">12: </span><span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">true</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org2f1ba4e" class="outline-3">
<h3 id="org2f1ba4e"><span class="section-number-3">2.2.</span> When the state variable cannot be avoided</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><p>
the function needs to return the state
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #51afef;">type</span> <span style="color: #ECBE7B;">quoter</span> <span style="color: #51afef;">struct</span> {
    state <span style="color: #ECBE7B;">int</span>
}

<span style="color: #51afef;">func</span> (<span style="color: #dcaeea;">q</span> *<span style="color: #ECBE7B;">quoter</span>) <span style="color: #c678dd;">Init</span>() {
    r.state = <span style="color: #da8548; font-weight: bold;">0</span>
}
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">proess each char based on current state</span>
<span style="color: #51afef;">func</span> (<span style="color: #dcaeea;">q</span> *<span style="color: #ECBE7B;">quoter</span>) <span style="color: #c678dd;">Write</span>(<span style="color: #dcaeea;">c</span> <span style="color: #ECBE7B;">rune</span>) <span style="color: #ECBE7B;">Status</span> {
    <span style="color: #51afef;">switch</span> q.state {
    <span style="color: #51afef;">case</span> <span style="color: #da8548; font-weight: bold;">0</span>:
        <span style="color: #51afef;">if</span> c != <span style="color: #98be65;">'"'</span> {
            <span style="color: #51afef;">return</span> BadInput
        }
        q.state = <span style="color: #da8548; font-weight: bold;">1</span>
    <span style="color: #51afef;">case</span> <span style="color: #da8548; font-weight: bold;">1</span>:
        <span style="color: #51afef;">if</span> c == <span style="color: #98be65;">'"'</span> {
            <span style="color: #51afef;">return</span> Success
        }
        <span style="color: #51afef;">if</span> c == <span style="color: #98be65;">'\\'</span> {
            q.state = <span style="color: #da8548; font-weight: bold;">2</span>
        } <span style="color: #51afef;">else</span> {
            q.state = <span style="color: #da8548; font-weight: bold;">1</span>
        }
    <span style="color: #51afef;">case</span> <span style="color: #da8548; font-weight: bold;">2</span>:
        q.state = <span style="color: #da8548; font-weight: bold;">1</span>
    }
    <span style="color: #51afef;">return</span> NeedMoreInput
}
</pre>
</div></li>
<li><p>
use additional goroutines to hold states
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #51afef;">type</span> <span style="color: #ECBE7B;">quoter</span> <span style="color: #51afef;">struct</span> {
    char <span style="color: #51afef;">chan</span> <span style="color: #ECBE7B;">rune</span>
    status <span style="color: #51afef;">chan</span> <span style="color: #ECBE7B;">Status</span>
}
<span style="color: #51afef;">func</span> (<span style="color: #dcaeea;">q</span> *<span style="color: #ECBE7B;">quoter</span>) <span style="color: #c678dd;">Init</span>() {
    q.char = <span style="color: #c678dd;">make</span>(<span style="color: #51afef;">chan</span> <span style="color: #ECBE7B;">rune</span>)
    q.status = <span style="color: #c678dd;">make</span>(<span style="color: #51afef;">chan</span> <span style="color: #ECBE7B;">Status</span>)
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">need to make sure why and when the goroutine will exit</span>
    <span style="color: #51afef;">go</span> q.<span style="color: #c678dd;">parse</span>()
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">blocks until it receives an initial status from parse()</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">to ensure that parse() is ready, i.e., q.status = NeedMoreInput</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">before Write() is called</span>
    &lt;-q.status
}
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Write sends the next char to q.char, which will be receivecd by parse()</span>
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">the status is a public state accessible by the user</span>
<span style="color: #51afef;">func</span> (<span style="color: #dcaeea;">q</span> *<span style="color: #ECBE7B;">quoter</span>) <span style="color: #c678dd;">Write</span>(<span style="color: #dcaeea;">r</span> <span style="color: #ECBE7B;">rune</span>) <span style="color: #ECBE7B;">Status</span> {
    q.char &lt;- c
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">wait for the result</span>
    <span style="color: #51afef;">return</span> &lt;-q.status
}
<span style="color: #51afef;">func</span> (<span style="color: #dcaeea;">q</span> *<span style="color: #ECBE7B;">quoteReader</span>) <span style="color: #c678dd;">parse</span>() {
    <span style="color: #51afef;">if</span> q.<span style="color: #c678dd;">read</span>() != <span style="color: #98be65;">'"'</span> {
        q.status &lt;- SyntaxError
        <span style="color: #51afef;">return</span>
    }
    <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">c</span> <span style="color: #ECBE7B;">rune</span>
    <span style="color: #51afef;">for</span> c!= <span style="color: #98be65;">'"'</span> {
        c = q.<span style="color: #c678dd;">read</span>()
        <span style="color: #51afef;">if</span> c == <span style="color: #98be65;">'\\'</span> {
            q.<span style="color: #c678dd;">read</span>()
        }
    }
    q.status &lt;- Done
}
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">a helper function used in parse() to return the next char in q.char</span>
<span style="color: #51afef;">func</span> (<span style="color: #dcaeea;">q</span> *<span style="color: #ECBE7B;">quoter</span>) <span style="color: #c678dd;">read</span>() <span style="color: #ECBE7B;">int</span> {
    q.status &lt;- NeedMoreInput
    <span style="color: #51afef;">return</span> &lt;- q.char
}
<span style="color: #51afef;">func</span> <span style="color: #c678dd;">main</span>() {
    <span style="color: #dcaeea;">q</span> := &amp;<span style="color: #ECBE7B;">quoter</span>{}
    q.<span style="color: #c678dd;">Init</span>()

    <span style="color: #dcaeea;">input</span> := <span style="color: #98be65;">`"Hello, \"World\""`</span>
    <span style="color: #51afef;">for</span> <span style="color: #dcaeea;">_</span>, <span style="color: #dcaeea;">c</span> := <span style="color: #51afef;">range</span> input {
        <span style="color: #dcaeea;">status</span> := q.<span style="color: #c678dd;">Write</span>(c)
    }
}
</pre>
</div></li>
</ul>
</div>
</div>
</div>
<div class="taglist"><a href="https://chenyo-17.github.io/org-static-blog/tags.html">Tags</a>: <a href="https://chenyo-17.github.io/org-static-blog/tag-lang:go.html">lang:go</a> <a href="https://chenyo-17.github.io/org-static-blog/tag-design-patterns.html">design-patterns</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
